# pyDataFrames02

Include this line to enable auto completion:

In [1]:
%config Completer.use_jedi = False

In [2]:
import pandas as pd

Generate some lists:

In [3]:
name = ['Mark', 'Dave', 'John']

In [4]:
age = [55, 36, 42]

In [5]:
weight = [230, 165, 195]

In [6]:
name

['Mark', 'Dave', 'John']

In [7]:
age

[55, 36, 42]

In [8]:
weight

[230, 165, 195]

Create a data frame from a dictionary of these lists.

In [9]:
dfPeople = pd.DataFrame({'Name':name, 'Age':age, 'Weight':weight})

In [10]:
dfPeople

   Name  Age  Weight
0  Mark   55     230
1  Dave   36     165
2  John   42     195

In [11]:
dfPeople.describe()

             Age      Weight
count   3.000000    3.000000
mean   44.333333  196.666667
std     9.712535   32.532035
min    36.000000  165.000000
25%    39.000000  180.000000
50%    42.000000  195.000000
75%    48.500000  212.500000
max    55.000000  230.000000